xfsmart/betaflight/src/platform/common/stm32/pwm_output_dshot_shared.c
/*
 * This file is part of Cleanflight and Betaflight.
 *
 * Cleanflight and Betaflight are free software. You can redistribute
 * this software and/or modify this software under the terms of the
 * GNU General Public License as published by the Free Software
 * Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * Cleanflight and Betaflight are distributed in the hope that they
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied
 * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "platform.h"

#ifdef USE_DSHOT

#include "build/debug.h"

#include "drivers/dma.h"
#include "drivers/dma_reqmap.h"
#include "platform/dma.h"
#include "drivers/io.h"
#include "drivers/nvic.h"
#include "platform/rcc.h"
#include "drivers/time.h"
#include "drivers/timer.h"
#include "platform/timer.h"
#if defined(STM32F4)
#include "stm32f4xx.h"
#endif

#include "drivers/pwm_output.h"
#include "drivers/dshot.h"
#include "dshot_dpwm.h"
#include "drivers/dshot_command.h"
#include "drivers/motor.h"

#include "pwm_output_dshot_shared.h"

FAST_DATA_ZERO_INIT uint8_t dmaMotorTimerCount = 0;

#ifdef STM32F7
FAST_DATA_ZERO_INIT motorDmaTimer_t dmaMotorTimers[MAX_DMA_TIMERS];
FAST_DATA_ZERO_INIT motorDmaOutput_t dmaMotors[MAX_SUPPORTED_MOTORS];
#else
motorDmaTimer_t dmaMotorTimers[MAX_DMA_TIMERS];
motorDmaOutput_t dmaMotors[MAX_SUPPORTED_MOTORS];
#endif

#if defined(FT32F4) && defined(USE_DSHOT_TELEMETRY)
#define FT32_DSHOT_DIRECTION_RECOVERY_PENDING UINT8_MAX

static bool pwmDshotDirectionRecoveryIsPending(const motorDmaOutput_t *motor)
{
    return *(const volatile uint8_t *)&motor->dmaInputLen == FT32_DSHOT_DIRECTION_RECOVERY_PENDING;
}
#endif

#ifdef FT32F4
static bool pwmDshotTryEnableMotor(motorDmaOutput_t *motor)
{
    DMA_ARCH_TYPE *dmaRef = (DMA_ARCH_TYPE *)motor->dmaRef;
    xDMA_Cmd(dmaRef, ENABLE);
    if (!ft32DmaIsChannelEnabled(dmaRef)) {
        ft32DmaRequestDisable(dmaRef);
        return false;
    }
    return true;
}

#ifdef USE_DSHOT_DMAR
static bool pwmDshotTryStopBurstMotor(const motorDmaOutput_t *motor)
{
    DMA_ARCH_TYPE *dmaRef = (DMA_ARCH_TYPE *)motor->timer->dmaBurstRef;
    if (!dmaRef) {
        return false;
    }
    ft32DmaRequestDisable(dmaRef);
    return !ft32DmaIsChannelEnabled(dmaRef);
}

#ifdef USE_DSHOT_TELEMETRY
static bool pwmDshotBurstTimerIsUnavailable(const motorDmaTimer_t *motorTimer)
{
    for (unsigned i = 0; i < dshotMotorCount; i++) {
        if (dmaMotors[i].timer == motorTimer &&
            (dmaMotors[i].isInput || pwmDshotDirectionRecoveryIsPending(&dmaMotors[i]))) {
            return true;
        }
    }
    return false;
}
#endif
#endif
#endif

#ifdef USE_DSHOT_TELEMETRY
FAST_DATA_ZERO_INIT uint32_t inputStampUs;

FAST_DATA_ZERO_INIT dshotTelemetryCycleCounters_t dshotDMAHandlerCycleCounters;
#endif

motorDmaOutput_t *getMotorDmaOutput(unsigned index)
{
    if (index >= ARRAYLEN(dmaMotors)) {
        return NULL;
    }
    return &dmaMotors[index];
}

bool pwmDshotIsMotorIdle(unsigned index)
{
    const motorDmaOutput_t *motor = getMotorDmaOutput(index);
    return motor && motor->protocolControl.value == 0;
}

void pwmDshotRequestTelemetry(unsigned index)
{
    motorDmaOutput_t * const motor = getMotorDmaOutput(index);
    if (motor) {
        motor->protocolControl.requestTelemetry = true;
    }
}

uint8_t getTimerIndex(void *timer)
{
    for (int i = 0; i < dmaMotorTimerCount; i++) {
        if (dmaMotorTimers[i].timer == timer) {
            return i;
        }
    }
    dmaMotorTimers[dmaMotorTimerCount++].timer = timer;
    return dmaMotorTimerCount - 1;
}

/**
 * Prepare to send dshot data for one motor
 *
 * Formats the value into the appropriate dma buffer and enables the dma channel.
 * The packet won't start transmitting until later since the dma requests from the timer
 * are disabled when this function is called.
 *
 * @param index index of the motor that the data is to be sent to
 * @param value the dshot value to be sent
*/
FAST_CODE void pwmWriteDshotInt(uint8_t index, uint16_t value)
{
    motorDmaOutput_t *const motor = &dmaMotors[index];

    if (!motor->configured) {
        return;
    }

#ifdef FT32F4
    motor->timer->timerDmaSources &= ~motor->timerDmaSource;
#ifdef USE_DSHOT_DMAR
    if (useBurstDshot) {
        TIM_DMACmd((TIM_TypeDef *)motor->timerHardware->tim, TIM_DMA_Update, DISABLE);
        if (motor->timer->dmaBurstLength == UINT16_MAX) {
            return;
        }
#ifdef USE_DSHOT_TELEMETRY
        if (pwmDshotBurstTimerIsUnavailable(motor->timer)) {
            motor->timer->dmaBurstLength = UINT16_MAX;
            return;
        }
#endif
        if (!pwmDshotTryStopBurstMotor(motor)) {
            motor->timer->dmaBurstLength = UINT16_MAX;
            return;
        }
    } else
#endif
    {
        DMA_ARCH_TYPE *dmaRef = (DMA_ARCH_TYPE *)motor->dmaRef;
        TIM_DMACmd((TIM_TypeDef *)motor->timerHardware->tim, motor->timerDmaSource, DISABLE);
#ifdef USE_DSHOT_TELEMETRY
        if (motor->isInput || pwmDshotDirectionRecoveryIsPending(motor)) {
            return;
        }
#endif
        if (!ft32DmaTrySetCurrDataCounter(dmaRef, motor->dmaInitStruct.BlockTransSize)) {
            return;
        }
        DMA_SetSrcAddress(dmaRef, (uint32_t)motor->dmaBuffer);
    }
#endif

    /*If there is a command ready to go overwrite the value and send that instead*/
    if (dshotCommandIsProcessing()) {
        value = dshotCommandGetCurrent(index);
        if (value) {
            motor->protocolControl.requestTelemetry = true;
        }
    }

    motor->protocolControl.value = value;

    uint16_t packet = prepareDshotPacket(&motor->protocolControl);
    uint8_t bufferSize;

#ifdef USE_DSHOT_DMAR
    if (useBurstDshot) {
        bufferSize = loadDmaBuffer(&motor->timer->dmaBurstBuffer[timerLookupChannelIndex(motor->timerHardware->channel)], 4, packet);
        motor->timer->dmaBurstLength = bufferSize * 4;
    } else
#endif
    {
        bufferSize = loadDmaBuffer(motor->dmaBuffer, 1, packet);

#ifdef USE_FULL_LL_DRIVER
        motor->timer->timerDmaSources |= motor->timerDmaSource;
        xLL_EX_DMA_SetDataLength(motor->dmaRef, bufferSize);
        xLL_EX_DMA_EnableResource(motor->dmaRef);
#else
#ifdef FT32F4
        if (bufferSize != motor->dmaInitStruct.BlockTransSize || !pwmDshotTryEnableMotor(motor)) {
            return;
        }
#else
        xDMA_SetCurrDataCounter(motor->dmaRef, bufferSize);
#endif

        motor->timer->timerDmaSources |= motor->timerDmaSource;

// XXX we can remove this ifdef if we add a new macro for the TRUE/ENABLE constants
#if defined(FT32F4)
        // The FT32 channel was enabled and checked before publishing timerDmaSources.
#elif defined(AT32F435)
        xDMA_Cmd(motor->dmaRef, TRUE);
#else
        xDMA_Cmd(motor->dmaRef, ENABLE);
#endif

#endif // USE_FULL_LL_DRIVER
    }

}

#ifdef USE_DSHOT_TELEMETRY

void dshotEnableChannels(unsigned motorCount);

static uint32_t decodeTelemetryPacket(const uint32_t buffer[], uint32_t count)
{
    uint32_t value = 0;
    uint32_t oldValue = buffer[0];
    int bits = 0;
    int len;
    for (uint32_t i = 1; i <= count; i++) {
        if (i < count) {
            int diff = buffer[i] - oldValue;
            if (bits >= 21) {
                break;
            }
            len = (diff + 8) / 16;
        } else {
            len = 21 - bits;
        }

        value <<= len;
        value |= 1 << (len - 1);
        oldValue = buffer[i];
        bits += len;
    }
    if (bits != 21) {
        return 0xffff;
    }

    static const uint32_t decode[32] = {
        0, 0, 0, 0, 0, 0, 0, 0, 0, 9, 10, 11, 0, 13, 14, 15,
        0, 0, 2, 3, 0, 5, 6, 7, 0, 0, 8, 1, 0, 4, 12, 0 };

    uint32_t decodedValue = decode[value & 0x1f];
    decodedValue |= decode[(value >> 5) & 0x1f] << 4;
    decodedValue |= decode[(value >> 10) & 0x1f] << 8;
    decodedValue |= decode[(value >> 15) & 0x1f] << 12;

    uint32_t csum = decodedValue;
    csum = csum ^ (csum >> 8); // xor bytes
    csum = csum ^ (csum >> 4); // xor nibbles

    if ((csum & 0xf) != 0xf) {
        return DSHOT_TELEMETRY_INVALID;
    }

    return decodedValue >> 4;
}

#endif

/**
 * Process dshot telemetry packets before switching the channels back to outputs
 *
*/
FAST_CODE_NOINLINE bool pwmTelemetryDecode(void)
{
#ifndef USE_DSHOT_TELEMETRY
    return true;
#else
    if (!useDshotTelemetry) {
        return true;
    }

#ifdef USE_DSHOT_TELEMETRY_STATS
    const timeMs_t currentTimeMs = millis();
#endif
    const timeUs_t currentUs = micros();

    for (int i = 0; i < dshotMotorCount; i++) {
        timeDelta_t usSinceInput = cmpTimeUs(currentUs, inputStampUs);
        if (usSinceInput >= 0 && usSinceInput < dmaMotors[i].dshotTelemetryDeadtimeUs) {
            return false;
        }
        if (dmaMotors[i].isInput) {
#ifdef USE_FULL_LL_DRIVER
            uint32_t edges = GCR_TELEMETRY_INPUT_LEN - xLL_EX_DMA_GetDataLength(dmaMotors[i].dmaRef);
#else
            uint32_t edges = GCR_TELEMETRY_INPUT_LEN - xDMA_GetCurrDataCounter(dmaMotors[i].dmaRef);
#endif

#ifdef USE_FULL_LL_DRIVER
            LL_EX_TIM_DisableIT((TIM_TypeDef *)dmaMotors[i].timerHardware->tim, dmaMotors[i].timerDmaSource);
#elif defined(AT32F435)
            tmr_dma_request_enable((tmr_type *)dmaMotors[i].timerHardware->tim, dmaMotors[i].timerDmaSource, FALSE);
#else
            TIM_DMACmd((TIM_TypeDef *)dmaMotors[i].timerHardware->tim, dmaMotors[i].timerDmaSource, DISABLE);
#endif

            uint16_t rawValue;

            if (edges > MIN_GCR_EDGES) {
                dshotTelemetryState.readCount++;

                rawValue = decodeTelemetryPacket(dmaMotors[i].dmaBuffer, edges);

                if (rawValue != DSHOT_TELEMETRY_INVALID) {
                    // Check EDT enable or store raw value
                    if ((rawValue == 0x0E00) && (dshotCommandGetCurrent(i) == DSHOT_CMD_EXTENDED_TELEMETRY_ENABLE)) {
                        dshotTelemetryState.motorState[i].telemetryTypes = 1 << DSHOT_TELEMETRY_TYPE_STATE_EVENTS;
                    } else {
                        dshotTelemetryState.motorState[i].rawValue = rawValue;
                    }
                } else {
                    dshotTelemetryState.invalidPacketCount++;
                    if (i == 0) {
                        memcpy(dshotTelemetryState.inputBuffer, dmaMotors[i].dmaBuffer, sizeof(dshotTelemetryState.inputBuffer));
                    }
                }
#ifdef USE_DSHOT_TELEMETRY_STATS
                updateDshotTelemetryQuality(&dshotTelemetryQuality[i], rawValue != DSHOT_TELEMETRY_INVALID, currentTimeMs);
#endif
            }
        }
        pwmDshotSetDirectionOutput(&dmaMotors[i]);
    }

    dshotTelemetryState.rawValueState = DSHOT_RAW_VALUE_STATE_NOT_PROCESSED;
    inputStampUs = 0;
    dshotEnableChannels(dshotMotorCount);
    return true;
#endif // USE_DSHOT_TELEMETRY
}

#endif // USE_DSHOT
